SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26b500f3200im68.h
/* Common peripheral register block offsets. */
#define PER_REG_BLOCK_SET_OFFSET             0x1000UL    /**< Offset to SET register block */
#define PER_REG_BLOCK_CLR_OFFSET             0x2000UL    /**< Offset to CLEAR register block */
#define PER_REG_BLOCK_TGL_OFFSET             0x3000UL    /**< Offset to TOGGLE register block */
#define MSC_CDA_PRESENT                      0x0UL       /**>  */
#define MSC_FDIO_WIDTH                       0x40UL      /**> None */
#define MSC_FLASHADDRBITS                    0x16UL      /**> None */
#define MSC_FLASHBLOCKADDRBITS               0x16UL      /**> None */
#define MSC_FLASH_BLOCK_INFO_PCOUNT          0x2UL       /**> None */
#define MSC_FLASH_BLOCK_MAIN_PCOUNT          0x1A0UL     /**>  */
#define MSC_INFOADDRBITS                     0xEUL       /**> None */
#define MSC_INFOBLOCKADDRBITS                0xEUL       /**> None */
#define MSC_INFO_PSIZE_BITS                  0xDUL       /**> None */
#define MSC_MAIN_PSIZE_BITS                  0xDUL       /**> None */
#define MSC_REDUNDANCY                       0x4UL       /**> None */
#define MSC_ROOTMAIN_PRESENT                 0x1UL       /**>  */
#define MSC_UD_PRESENT                       0x1UL       /**>  */
#define MSC_YADDRBITS                        0x6UL       /**>  */
#define DMEM0_AHB_DATA_WIDTH                 0x20UL      /**> Data width of the AHB interface */
#define DMEM0_BANK0_SIZE                     0x4000UL    /**> Bank0 size */
#define DMEM0_BANK10_SIZE                    0x4000UL    /**> Bank10 size */
#define DMEM0_BANK11_SIZE                    0x4000UL    /**> Bank11 size */
#define DMEM0_BANK12_SIZE                    0x4000UL    /**> Bank12 size */
#define DMEM0_BANK13_SIZE                    0x4000UL    /**> Bank13 size */
#define DMEM0_BANK14_SIZE                    0x4000UL    /**> Bank14 size */
#define DMEM0_BANK15_SIZE                    0x4000UL    /**> Bank15 size */
#define DMEM0_BANK16_SIZE                    0x0UL       /**> Bank16 size */
#define DMEM0_BANK17_SIZE                    0x0UL       /**> Bank17 size */
#define DMEM0_BANK18_SIZE                    0x0UL       /**> Bank18 size */
#define DMEM0_BANK19_SIZE                    0x0UL       /**> Bank19 size */
#define DMEM0_BANK1_SIZE                     0x4000UL    /**> Bank1 size */
#define DMEM0_BANK20_SIZE                    0x0UL       /**> Bank20 size */
#define DMEM0_BANK21_SIZE                    0x0UL       /**> Bank21 size */
#define DMEM0_BANK22_SIZE                    0x0UL       /**> Bank22 size */
#define DMEM0_BANK23_SIZE                    0x0UL       /**> Bank23 size */
#define DMEM0_BANK24_SIZE                    0x0UL       /**> Bank24 size */
#define DMEM0_BANK25_SIZE                    0x0UL       /**> Bank25 size */
#define DMEM0_BANK26_SIZE                    0x0UL       /**> Bank26 size */
#define DMEM0_BANK27_SIZE                    0x0UL       /**> Bank27 size */
#define DMEM0_BANK28_SIZE                    0x0UL       /**> Bank28 size */
#define DMEM0_BANK29_SIZE                    0x0UL       /**> Bank29 size */
#define DMEM0_BANK2_SIZE                     0x4000UL    /**> Bank2 size */
#define DMEM0_BANK30_SIZE                    0x0UL       /**> Bank30 size */
#define DMEM0_BANK31_SIZE                    0x0UL       /**> Bank31 size */
#define DMEM0_BANK3_SIZE                     0x4000UL    /**> Bank3 size */
#define DMEM0_BANK4_SIZE                     0x4000UL    /**> Bank4 size */
#define DMEM0_BANK5_SIZE                     0x4000UL    /**> Bank5 size */
#define DMEM0_BANK6_SIZE                     0x4000UL    /**> Bank6 size */
#define DMEM0_BANK7_SIZE                     0x4000UL    /**> Bank7 size */
#define DMEM0_BANK8_SIZE                     0x4000UL    /**> Bank8 size */
#define DMEM0_BANK9_SIZE                     0x4000UL    /**> Bank9 size */
#define DMEM0_ECC_EXCLUDE                    0x0UL       /**> ECC exclude */
#define DMEM0_MEM_SIZE                       0x40000UL   /**> Total memory size */
#define DMEM0_NUM_BANKS                      0x10UL      /**> Number of physical SRAM banks */
#define DMEM0_NUM_PORTS                      0x4UL       /**> Number of AHB slave ports */
#define DMEM0_NUM_PORTS_IS_2                 0x0UL       /**> Boolean indicating if NUM_PORTS=2 */
#define DMEM0_WAITSTATE_EXCLUDE              0x1UL       /**> Waitstate exclude */
#define DMEM1_AHB_DATA_WIDTH                 0x20UL      /**> Data width of the AHB interface */
#define DMEM1_BANK0_SIZE                     0x4000UL    /**> Bank0 size */
#define DMEM1_BANK10_SIZE                    0x4000UL    /**> Bank10 size */
#define DMEM1_BANK11_SIZE                    0x4000UL    /**> Bank11 size */
#define DMEM1_BANK12_SIZE                    0x4000UL    /**> Bank12 size */
#define DMEM1_BANK13_SIZE                    0x4000UL    /**> Bank13 size */
#define DMEM1_BANK14_SIZE                    0x4000UL    /**> Bank14 size */
#define DMEM1_BANK15_SIZE                    0x4000UL    /**> Bank15 size */
#define DMEM1_BANK16_SIZE                    0x0UL       /**> Bank16 size */
#define DMEM1_BANK17_SIZE                    0x0UL       /**> Bank17 size */
#define DMEM1_BANK18_SIZE                    0x0UL       /**> Bank18 size */
#define DMEM1_BANK19_SIZE                    0x0UL       /**> Bank19 size */
#define DMEM1_BANK1_SIZE                     0x4000UL    /**> Bank1 size */
#define DMEM1_BANK20_SIZE                    0x0UL       /**> Bank20 size */
#define DMEM1_BANK21_SIZE                    0x0UL       /**> Bank21 size */
#define DMEM1_BANK22_SIZE                    0x0UL       /**> Bank22 size */
#define DMEM1_BANK23_SIZE                    0x0UL       /**> Bank23 size */
#define DMEM1_BANK24_SIZE                    0x0UL       /**> Bank24 size */
#define DMEM1_BANK25_SIZE                    0x0UL       /**> Bank25 size */
#define DMEM1_BANK26_SIZE                    0x0UL       /**> Bank26 size */
#define DMEM1_BANK27_SIZE                    0x0UL       /**> Bank27 size */
#define DMEM1_BANK28_SIZE                    0x0UL       /**> Bank28 size */
#define DMEM1_BANK29_SIZE                    0x0UL       /**> Bank29 size */
#define DMEM1_BANK2_SIZE                     0x4000UL    /**> Bank2 size */
#define DMEM1_BANK30_SIZE                    0x0UL       /**> Bank30 size */
#define DMEM1_BANK31_SIZE                    0x0UL       /**> Bank31 size */
#define DMEM1_BANK3_SIZE                     0x4000UL    /**> Bank3 size */
#define DMEM1_BANK4_SIZE                     0x4000UL    /**> Bank4 size */
#define DMEM1_BANK5_SIZE                     0x4000UL    /**> Bank5 size */
#define DMEM1_BANK6_SIZE                     0x4000UL    /**> Bank6 size */
#define DMEM1_BANK7_SIZE                     0x4000UL    /**> Bank7 size */
#define DMEM1_BANK8_SIZE                     0x4000UL    /**> Bank8 size */
#define DMEM1_BANK9_SIZE                     0x4000UL    /**> Bank9 size */
#define DMEM1_ECC_EXCLUDE                    0x0UL       /**> ECC exclude */
#define DMEM1_MEM_SIZE                       0x40000UL   /**> Total memory size */
#define DMEM1_NUM_BANKS                      0x10UL      /**> Number of physical SRAM banks */
#define DMEM1_NUM_PORTS                      0x4UL       /**> Number of AHB slave ports */
#define DMEM1_NUM_PORTS_IS_2                 0x0UL       /**> Boolean indicating if NUM_PORTS=2 */
#define DMEM1_WAITSTATE_EXCLUDE              0x1UL       /**> Waitstate exclude */
#define CMU_EXCLUDELCD                       0x0UL       /**> Exclude LCD */
#define CMU_EXCLUDELESENSE                   0x1UL       /**> Exclude LESENSE */
#define BURTC_CNTWIDTH                       0x20UL      /**> None */
#define BURTC_PRECNT_WIDTH                   0xFUL       /**>  */
#define HFRCO0_EM23ONDEMAND                  0x0UL       /**> EM23 On Demand */
#define HFRCO0_EXCLUDEEM23ONDEMAND           0x1UL       /**> Exclude EM23 On Demand */
#define LFXO_NO_CTUNE                        0x0UL       /**> CTUNE Not Present */
#define LFXO_CTUNE                           0x1UL       /**> CTUNE Present */
#define KEYSCAN_COLNUM                       0x8UL       /**> COLNUM */
#define KEYSCAN_COLWIDTH                     0x3UL       /**> COLWIDTH */
#define KEYSCAN_ROWNUM                       0x6UL       /**> ROWNUM */
#define ICACHE0_AHB_LITE                     0x0UL       /**> AHB Lite */
#define ICACHE0_CACHEABLE_SIZE               0x320000UL  /**> Cache Size */
#define ICACHE0_CACHEABLE_START              0x8000000UL /**> Cache Start */
#define ICACHE0_DEFAULT_OFF                  0x0UL       /**> Default off */
#define ICACHE0_FLASH_SIZE                   0x320000UL  /**> Flash size */
#define ICACHE0_FLASH_START                  0x8000000UL /**> Flash start */
#define ICACHE0_LOOPCACHE_MEM_ADDR_BITS      0x3UL       /**> Loopcache Memory Address bits */
#define ICACHE0_LOOPCACHE_STICKINESS_BITS    0x4UL       /**> Loopcache Stickiness bits */
#define ICACHE0_PARITY_BITS                  0x1UL       /**> Use Parity */
#define ICACHE0_PC_BITS                      0x20UL      /**> Performance Counter bits */
#define ICACHE0_PIPE_STAGE                   0x1UL       /**> Pipeline Stage */
#define ICACHE0_RAM_ADDR_BITS                0x0UL       /**> RAM Address bits */
#define ICACHE0_RAM_DATA_BITS                0x0UL       /**> RAM Data bits */
#define ICACHE0_SET_BITS                     0x7UL       /**> Set bits */
#define ICACHE0_USE_HREADY_GATING            0x1UL       /**> Use HREADY gating */
#define ICACHE0_USE_IDLE_GATING              0x1UL       /**> Use IDLE gating */
#define ICACHE0_USE_LOOPCACHE                0x1UL       /**> Use Loopcache */
#define ICACHE0_WAY_BITS                     0x1UL       /**> Way bits */
#define ICACHE0_WORDS_PER_BLOCK              0x0UL       /**> Words Per Block */
#define ICACHE0_WPB_BITS                     0x1UL       /**> Words Per Block bits */
#define ICACHE0_WPL_BITS                     0x3UL       /**> Words Per Line bits */
#define PRS_ASYNC_CH_NUM                     0x10UL      /**> None */
#define PRS_PRSSEL_WIDTH                     0x4UL       /**> New Param */
#define PRS_SPRSSEL_WIDTH                    0x2UL       /**> New Param */
#define PRS_SYNC_CH_NUM                      0x4UL       /**> None */
#define GPIO_COMALLOC_WIDTH                  0x4UL       /**> New Param */
#define GPIO_MODE_WIDTH                      0x4UL       /**> Mode Width */
#define GPIO_NUM_EM4_WU                      0xCUL       /**> New Param */
#define GPIO_NUM_EVEN_PA                     0x8UL       /**> Num of even pins port A */
#define GPIO_NUM_EVEN_PB                     0x8UL       /**> Num of even pins port B */
#define GPIO_NUM_EVEN_PC                     0x8UL       /**> Num of even pins port C */
#define GPIO_NUM_EVEN_PD                     0x8UL       /**> Num of even pins port D */
#define GPIO_NUM_EXT_INT                     0x10UL      /**> New Param */
#define GPIO_NUM_EXT_INT_L                   0x8UL       /**> New Param */
#define GPIO_NUM_EXT_INT_U                   0x8UL       /**> New Param */
#define GPIO_NUM_EXT_INT_U_ZERO              0x0UL       /**> New Param */
#define GPIO_NUM_ODD_PA                      0x8UL       /**> Num of odd pins port A */
#define GPIO_NUM_ODD_PB                      0x8UL       /**> Num of odd pins port B */
#define GPIO_NUM_ODD_PC                      0x8UL       /**> Num of odd pins port C */
#define GPIO_NUM_ODD_PD                      0x8UL       /**> Num of odd pins port D */
#define GPIO_PINSEL_WIDTH                    0x4UL       /**> Route config pin select width */
#define GPIO_PORTSEL_WIDTH                   0x2UL       /**> Route config port select width */
#define GPIO_PORT_A_WIDTH                    0x10UL      /**> Port A Width */
#define GPIO_PORT_A_WIDTH_ZERO               0x0UL       /**> Port A Width is Zero */
#define GPIO_PORT_A_WL                       0x8UL       /**> New Param */
#define GPIO_PORT_A_WU                       0x8UL       /**> New Param */
#define GPIO_PORT_A_WU_ZERO                  0x0UL       /**> New Param */
#define GPIO_PORT_B_WIDTH                    0x10UL      /**> Port B Width */
#define GPIO_PORT_B_WIDTH_ZERO               0x0UL       /**> Port B Width is Zero */
#define GPIO_PORT_B_WL                       0x8UL       /**> New Param */
#define GPIO_PORT_B_WU                       0x8UL       /**> New Param */
#define GPIO_PORT_B_WU_ZERO                  0x0UL       /**> New Param */
#define GPIO_PORT_C_WIDTH                    0x10UL      /**> Port C Width */
#define GPIO_PORT_C_WIDTH_ZERO               0x0UL       /**> Port C Width is Zero */
#define GPIO_PORT_C_WL                       0x8UL       /**> New Param */
#define GPIO_PORT_C_WU                       0x8UL       /**> New Param */
#define GPIO_PORT_C_WU_ZERO                  0x0UL       /**> New Param */
#define GPIO_PORT_D_WIDTH                    0x10UL      /**> Port D Width */
#define GPIO_PORT_D_WIDTH_ZERO               0x0UL       /**> Port D Width is Zero */
#define GPIO_PORT_D_WL                       0x8UL       /**> New Param */
#define GPIO_PORT_D_WU                       0x8UL       /**> New Param */
#define GPIO_PORT_D_WU_ZERO                  0x0UL       /**> New Param */
#define GPIO_SEGALLOC_WIDTH                  0x28UL      /**> New Param */
#define GPIO_SLEWRATE_WIDTH                  0x3UL       /**> Slew Rate Width Param */
#define LDMA_CH_BITS                         0x5UL       /**> New Param */
#define LDMA_CH_NUM                          0x8UL       /**> New Param */
#define LDMA_FIFO_BITS                       0x5UL       /**> New Param */
#define LDMA_FIFO_DEPTH                      0x10UL      /**> New Param */
#define LDMAXBAR_CH_BITS                     0x5UL       /**> None */
#define LDMAXBAR_CH_NUM                      0x8UL       /**> None */
#define LDMAXBAR_SIGSEL_W                    0x4UL       /**> New Param */
#define LDMAXBAR_SOURCESEL_W                 0x6UL       /**> New Param */
#define TIMER0_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER0_CNTWIDTH                      0x20UL      /**> Counter Width */
#define TIMER0_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER0_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER0_NO_DTI                        0x0UL       /**>  */
#define TIMER1_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER1_CNTWIDTH                      0x20UL      /**> Counter Width */
#define TIMER1_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER1_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER1_NO_DTI                        0x0UL       /**>  */
#define TIMER2_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER2_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER2_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER2_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER2_NO_DTI                        0x0UL       /**>  */
#define TIMER3_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER3_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER3_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER3_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER3_NO_DTI                        0x0UL       /**>  */
#define TIMER4_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER4_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER4_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER4_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER4_NO_DTI                        0x0UL       /**>  */
#define TIMER5_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER5_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER5_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER5_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER5_NO_DTI                        0x0UL       /**>  */
#define TIMER6_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER6_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER6_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER6_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER6_NO_DTI                        0x0UL       /**>  */
#define TIMER7_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER7_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER7_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER7_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER7_NO_DTI                        0x0UL       /**>  */
#define TIMER8_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER8_CNTWIDTH                      0x20UL      /**> Counter Width */
#define TIMER8_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER8_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER8_NO_DTI                        0x0UL       /**>  */
#define TIMER9_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER9_CNTWIDTH                      0x20UL      /**> Counter Width */
#define TIMER9_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER9_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER9_NO_DTI                        0x0UL       /**>  */
#define SYSCFG_CHIP_PARTNUMBER               0x3UL       /**> Chip Part Number */
#define SYSCFG_DEMODRAM_INST_COUNT           0x2UL       /**>  */
#define SYSCFG_FRCRAM_INST_COUNT             0x1UL       /**>  */
#define SYSCFG_SEQRAM_INST_COUNT             0x2UL       /**> None */
#define SYSCFG_SWINT_NUM                     0x4UL       /**> Software interupts */
#define EUSART1_EM2_CAPABLE                  0x0UL       /**> EM2 Capable instance */
#define EUSART1_NOT_EM2_CAPABLE              0x1UL       /**> Not EM2 Capable instance */
#define EUSART2_EM2_CAPABLE                  0x0UL       /**> EM2 Capable instance */
#define EUSART2_NOT_EM2_CAPABLE              0x1UL       /**> Not EM2 Capable instance */
#define EUSART3_EM2_CAPABLE                  0x0UL       /**> EM2 Capable instance */
#define EUSART3_NOT_EM2_CAPABLE              0x1UL       /**> Not EM2 Capable instance */
#define DCDC_DRVSPEED_WIDTH                  0x2UL       /**> Drive Speed bitfield width */
#define DCDC_IPKVAL_WIDTH                    0x4UL       /**> Peak Current Setting bitfield Width */
#define DCDC_VCMPIBIAS_WIDTH                 0x2UL       /**> VCMP ibias bitfield width */
#define HOSTMAILBOX_NUM_MSGPTRS              0x4UL       /**>  */
#define USART0_AUTOTX_REG                    0x1UL       /**> None */
#define USART0_AUTOTX_REG_B                  0x0UL       /**> None */
#define USART0_AUTOTX_TRIGGER                0x1UL       /**> None */
#define USART0_AUTOTX_TRIGGER_B              0x0UL       /**> New Param */
#define USART0_CLK_PRS                       0x1UL       /**> None */
#define USART0_CLK_PRS_B                     0x0UL       /**> New Param */
#define USART0_FLOW_CONTROL                  0x1UL       /**> None */
#define USART0_FLOW_CONTROL_B                0x0UL       /**> New Param */
#define USART0_I2S                           0x1UL       /**> None */
#define USART0_I2S_B                         0x0UL       /**> New Param */
#define USART0_IRDA_AVAILABLE                0x1UL       /**> None */
#define USART0_IRDA_AVAILABLE_B              0x0UL       /**> New Param */
#define USART0_MVDIS_FUNC                    0x1UL       /**> None */
#define USART0_MVDIS_FUNC_B                  0x0UL       /**> New Param */
#define USART0_RX_PRS                        0x1UL       /**> None */
#define USART0_RX_PRS_B                      0x0UL       /**> New Param */
#define USART0_SC_AVAILABLE                  0x1UL       /**> None */
#define USART0_SC_AVAILABLE_B                0x0UL       /**> New Param */
#define USART0_SYNC_AVAILABLE                0x1UL       /**> None */
#define USART0_SYNC_AVAILABLE_B              0x0UL       /**> New Param */
#define USART0_SYNC_LATE_SAMPLE              0x1UL       /**> None */
#define USART0_SYNC_LATE_SAMPLE_B            0x0UL       /**> New Param */
#define USART0_TIMER                         0x1UL       /**> New Param */
#define USART0_TIMER_B                       0x0UL       /**> New Param */
#define USART1_AUTOTX_REG                    0x1UL       /**> None */
#define USART1_AUTOTX_REG_B                  0x0UL       /**> None */
#define USART1_AUTOTX_TRIGGER                0x1UL       /**> None */
#define USART1_AUTOTX_TRIGGER_B              0x0UL       /**> New Param */
#define USART1_CLK_PRS                       0x1UL       /**> None */
#define USART1_CLK_PRS_B                     0x0UL       /**> New Param */
#define USART1_FLOW_CONTROL                  0x1UL       /**> None */
#define USART1_FLOW_CONTROL_B                0x0UL       /**> New Param */
#define USART1_I2S                           0x1UL       /**> None */
#define USART1_I2S_B                         0x0UL       /**> New Param */
#define USART1_IRDA_AVAILABLE                0x1UL       /**> None */
#define USART1_IRDA_AVAILABLE_B              0x0UL       /**> New Param */
#define USART1_MVDIS_FUNC                    0x1UL       /**> None */
#define USART1_MVDIS_FUNC_B                  0x0UL       /**> New Param */
#define USART1_RX_PRS                        0x1UL       /**> None */
#define USART1_RX_PRS_B                      0x0UL       /**> New Param */
#define USART1_SC_AVAILABLE                  0x1UL       /**> None */
#define USART1_SC_AVAILABLE_B                0x0UL       /**> New Param */
#define USART1_SYNC_AVAILABLE                0x1UL       /**> None */
#define USART1_SYNC_AVAILABLE_B              0x0UL       /**> New Param */
#define USART1_SYNC_LATE_SAMPLE              0x1UL       /**> None */
#define USART1_SYNC_LATE_SAMPLE_B            0x0UL       /**> New Param */
#define USART1_TIMER                         0x1UL       /**> New Param */
#define USART1_TIMER_B                       0x0UL       /**> New Param */
#define USART2_AUTOTX_REG                    0x1UL       /**> None */
#define USART2_AUTOTX_REG_B                  0x0UL       /**> None */
#define USART2_AUTOTX_TRIGGER                0x1UL       /**> None */
#define USART2_AUTOTX_TRIGGER_B              0x0UL       /**> New Param */
#define USART2_CLK_PRS                       0x1UL       /**> None */
#define USART2_CLK_PRS_B                     0x0UL       /**> New Param */
#define USART2_FLOW_CONTROL                  0x1UL       /**> None */
#define USART2_FLOW_CONTROL_B                0x0UL       /**> New Param */
#define USART2_I2S                           0x1UL       /**> None */
#define USART2_I2S_B                         0x0UL       /**> New Param */
#define USART2_IRDA_AVAILABLE                0x1UL       /**> None */
#define USART2_IRDA_AVAILABLE_B              0x0UL       /**> New Param */
#define USART2_MVDIS_FUNC                    0x1UL       /**> None */
