SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26b500f3200im68.h
#define USART2_MVDIS_FUNC_B                  0x0UL       /**> New Param */
#define USART2_RX_PRS                        0x1UL       /**> None */
#define USART2_RX_PRS_B                      0x0UL       /**> New Param */
#define USART2_SC_AVAILABLE                  0x1UL       /**> None */
#define USART2_SC_AVAILABLE_B                0x0UL       /**> New Param */
#define USART2_SYNC_AVAILABLE                0x1UL       /**> None */
#define USART2_SYNC_AVAILABLE_B              0x0UL       /**> New Param */
#define USART2_SYNC_LATE_SAMPLE              0x1UL       /**> None */
#define USART2_SYNC_LATE_SAMPLE_B            0x0UL       /**> New Param */
#define USART2_TIMER                         0x1UL       /**> New Param */
#define USART2_TIMER_B                       0x0UL       /**> New Param */
#define SYSRTC0_GROUP0_ALTIRQDIS             0x1UL       /**> Group 0 Alternate IRQ disable */
#define SYSRTC0_GROUP0_CAPDIS                0x0UL       /**> Group 0 Capture disable */
#define SYSRTC0_GROUP0_CMP1DIS               0x0UL       /**> Group 0 Compare1 disable */
#define SYSRTC0_GROUP0_DIS                   0x0UL       /**> Group 0 Disable */
#define SYSRTC0_GROUP0_ROOTDIS               0x1UL       /**> Group 0 ROOT disable */
#define SYSRTC0_GROUP1_ALTIRQDIS             0x0UL       /**> Group 1 Alternate IRQ disable */
#define SYSRTC0_GROUP1_CAPDIS                0x0UL       /**> Group 1 Capture disable */
#define SYSRTC0_GROUP1_CMP1DIS               0x0UL       /**> Group 1 Compare1 disable */
#define SYSRTC0_GROUP1_DIS                   0x0UL       /**> Group 1 Disable */
#define SYSRTC0_GROUP1_ROOTDIS               0x1UL       /**> Group 1 ROOT disable */
#define SYSRTC0_GROUP2_ALTIRQDIS             0x1UL       /**> Group 2 Alternate IRQ disable */
#define SYSRTC0_GROUP2_CAPDIS                0x1UL       /**> Group 2 Capture disable */
#define SYSRTC0_GROUP2_CMP1DIS               0x1UL       /**> Group 2 Compare1 disable */
#define SYSRTC0_GROUP2_DIS                   0x0UL       /**> Group 2 Disable */
#define SYSRTC0_GROUP2_ROOTDIS               0x0UL       /**> Group 2 ROOT disable */
#define SYSRTC0_GROUP3_ALTIRQDIS             0x1UL       /**> Group 3 Alternate IRQ disable */
#define SYSRTC0_GROUP3_CAPDIS                0x1UL       /**> Group 3 Capture disable */
#define SYSRTC0_GROUP3_CMP1DIS               0x1UL       /**> Group 3 Compare1 disable */
#define SYSRTC0_GROUP3_DIS                   0x1UL       /**> Group 3 Disable */
#define SYSRTC0_GROUP3_ROOTDIS               0x1UL       /**> Group 3 ROOT disable */
#define SYSRTC0_GROUP4_ALTIRQDIS             0x1UL       /**> Group 4 Alternate IRQ disable */
#define SYSRTC0_GROUP4_CAPDIS                0x1UL       /**> Group 4 Capture disable */
#define SYSRTC0_GROUP4_CMP1DIS               0x1UL       /**> Group 4 Compare1 disable */
#define SYSRTC0_GROUP4_DIS                   0x1UL       /**> Group 4 Disable */
#define SYSRTC0_GROUP4_ROOTDIS               0x1UL       /**> Group 4 ROOT disable */
#define SYSRTC0_GROUP5_ALTIRQDIS             0x1UL       /**> Group 5 Alternate IRQ disable */
#define SYSRTC0_GROUP5_CAPDIS                0x1UL       /**> Group 5 Capture disable */
#define SYSRTC0_GROUP5_CMP1DIS               0x1UL       /**> Group 5 Compare1 disable */
#define SYSRTC0_GROUP5_DIS                   0x1UL       /**> Group 5 Disable */
#define SYSRTC0_GROUP5_ROOTDIS               0x1UL       /**> Group 5 ROOT disable */
#define SYSRTC0_GROUP6_ALTIRQDIS             0x1UL       /**> Group 6 Alternate IRQ disable */
#define SYSRTC0_GROUP6_CAPDIS                0x1UL       /**> Group 6 Capture disable */
#define SYSRTC0_GROUP6_CMP1DIS               0x1UL       /**> Group 6 Compare1 disable */
#define SYSRTC0_GROUP6_DIS                   0x1UL       /**> Group 6 Disable */
#define SYSRTC0_GROUP6_ROOTDIS               0x1UL       /**> Group 6 ROOT disable */
#define SYSRTC0_GROUP7_ALTIRQDIS             0x1UL       /**> Group 7 Alternate IRQ disable */
#define SYSRTC0_GROUP7_CAPDIS                0x1UL       /**> Group 7 Capture disable */
#define SYSRTC0_GROUP7_CMP1DIS               0x1UL       /**> Group 7 Compare1 disable */
#define SYSRTC0_GROUP7_DIS                   0x1UL       /**> Group 7 Disable */
#define SYSRTC0_GROUP7_ROOTDIS               0x1UL       /**> Group 7 ROOT disable */
#define SYSRTC0_ROOTDIS                      0x0UL       /**> ROOT disable */
#define I2C1_DELAY                           0x7D0UL     /**> Delay cell selection */
#define I2C1_DELAY_CHAIN_NUM                 0x2UL       /**> Number of delay chain */
#define I2C2_DELAY                           0x7D0UL     /**> Delay cell selection */
#define I2C2_DELAY_CHAIN_NUM                 0x2UL       /**> Number of delay chain */
#define I2C3_DELAY                           0x7D0UL     /**> Delay cell selection */
#define I2C3_DELAY_CHAIN_NUM                 0x2UL       /**> Number of delay chain */
#define LCD_COM_NUM                          0x4UL       /**> None */
#define LCD_NO_ANIM_LOCS                     0x1UL       /**> None */
#define LCD_NO_BANKED_SEG                    0x1UL       /**>  */
#define LCD_NO_DSC                           0x0UL       /**> None */
#define LCD_NO_EXTOSC                        0x0UL       /**> None */
#define LCD_OCTAPLEX                         0x1UL       /**> None */
#define LCD_SEGASCOM_NUM                     0x4UL       /**> None */
#define LCD_NO_UPPER_SEGMENTS                0x0UL       /**>  */
#define LCD_SEG_NUM                          0x28UL      /**> None */
#define LCD_SEGASCOM_SEGSTART                0x24UL      /**>  */
#define LCD_SEL_WIDTH                        0x3UL       /**> None */
#define SMU_NUM_BMPUS                        0x9UL       /**> Number of BMPUs */
#define SMU_NUM_PPU_PERIPHS                  0x44UL      /**> Number of PPU Peripherals */
#define SMU_NUM_PPU_PERIPHS_MOD_32           0x4UL       /**> Number of PPU Peripherals (mod 32) */
#define SMU_NUM_PPU_PERIPHS_SUB_64           0x4UL       /**> Number of PPU peripherals minus 32 */
#define SMU_PERIPHID_BITS                    0x8UL       /**> Bits used for Peripheral ID */
#define LETIMER0_CNT_WIDTH                   0x18UL      /**> Count Width */
#define IADC0_CONFIGNUM                      0x2UL       /**> CONFIG */
#define IADC0_FULLRANGEUNIPOLAR              0x0UL       /**> FULLRANGEUNIPOLAR */
#define IADC0_SCANBYTES                      0x1UL       /**> SCANBYTES */
#define IADC0_ENTRIES                        0x10UL      /**> ENTRIES */
#define ACMP0_DAC_INPUT                      0x1UL       /**> None */
#define ACMP0_EXT_OVR_IF                     0x1UL       /**> None */
#define ACMP1_DAC_INPUT                      0x1UL       /**> None */
#define ACMP1_EXT_OVR_IF                     0x1UL       /**> None */
#define AMUXCP0_AMUXCPNUM                    0x0UL       /**> AMUXCPNUM */
#define VDAC0_ALT_WIDTH                      0x6UL       /**> VOUT_AUX Out Width */
#define VDAC0_CH0_TRIG_LESENSE               0x0UL       /**> CH0 Trig Source = LESENSE */
#define VDAC0_CH1_TRIG_LESENSE               0x0UL       /**> CH1 Trig Source = LESENSE */
#define VDAC0_FIFO_DEPTH                     0x4UL       /**> WFIFO Depth */
#define VDAC0_INT_PRESC_WIDTH                0x7UL       /**> Internal Prescaler Width */
#define VDAC0_RESOLUTION                     0xCUL       /**> DAC Resolution */
#define VDAC1_ALT_WIDTH                      0x6UL       /**> VOUT_AUX Out Width */
#define VDAC1_CH0_TRIG_LESENSE               0x0UL       /**> CH0 Trig Source = LESENSE */
#define VDAC1_CH1_TRIG_LESENSE               0x0UL       /**> CH1 Trig Source = LESENSE */
#define VDAC1_FIFO_DEPTH                     0x4UL       /**> WFIFO Depth */
#define VDAC1_INT_PRESC_WIDTH                0x7UL       /**> Internal Prescaler Width */
#define VDAC1_RESOLUTION                     0xCUL       /**> DAC Resolution */
#define PCNT0_PCNT_WIDTH                     0x10UL      /**> None */
#define HFRCOEM23_EM23ONDEMAND               0x1UL       /**> EM23 On Demand */
#define HFRCOEM23_EXCLUDEEM23ONDEMAND        0x0UL       /**> Exclude EM23 On Demand */
#define HFXO0_BUFOUT                         0x1UL       /**> BUFOUT */
#define HFXO0_EXCLUDEBUFOUT                  0x0UL       /**> Exclude BUFOUT */
#define I2C0_DELAY                           0x3E8UL     /**> Delay cell selection */
#define I2C0_DELAY_CHAIN_NUM                 0x2UL       /**> Number of delay chain */
#define WDOG0_PCNUM                          0x2UL       /**> None */
#define WDOG1_PCNUM                          0x2UL       /**> None */
#define EUSART0_EM2_CAPABLE                  0x1UL       /**> EM2 Capable instance */
#define EUSART0_NOT_EM2_CAPABLE              0x0UL       /**> Not EM2 Capable instance */
#define RDMEM_FRC_BANK0_SIZE                 0x1000UL    /**> FRC_RAM_BANK0_SIZE */
#define RDMEM_FRC_BANK1_SIZE                 0x0UL       /**> FRC_RAM_BANK1_SIZE */
#define RDMEM_FRC_BANK2_SIZE                 0x0UL       /**> FRC_RAM_BANK2_SIZE */
#define RDMEM_FRC_BANK3_SIZE                 0x0UL       /**> FRC_RAM_BANK3_SIZE */
#define RDMEM_FRC_BANK4_SIZE                 0x0UL       /**> FRC_RAM_BANK4_SIZE */
#define RDMEM_FRC_BANK5_SIZE                 0x0UL       /**> FRC_RAM_BANK5_SIZE */
#define RDMEM_FRC_BANK6_SIZE                 0x0UL       /**> FRC_RAM_BANK6_SIZE */
#define RDMEM_FRC_BANK7_SIZE                 0x0UL       /**> FRC_RAM_BANK7_SIZE */
#define RDMEM_FRC_NUM_BANK                   0x1UL       /**> FRC_NUM_BANK */
#define RDMEM_FRC_RAMADDRBITS                0xCUL       /**> FRC RAM ADDRBITS */
#define RDMEM_FRC_RAMADDRMINBITS             0xCUL       /**> FRC RAM address bits for one bank */
#define RDMEM_FRC_RAMECCADDR_WIDTH           0x20UL      /**> FRC RAM ECC Address width */
#define RDMEM_FRC_RAM_BWE_WIDTH              0x27UL      /**> FRCRAM BWE width */
#define RDMEM_FRC_RAM_DATA_WIDTH             0x27UL      /**> FRC_RAM_DATA_WIDTH */
#define RDMEM_FRC_RAM_ECC_EN                 0x1UL       /**> FRC RAM ECCEN */
#define RDMEM_FRC_RAM_TOTAL_SIZE             0x1000UL    /**> FRC_RAM_TOTAL_SIZE */
#define RDMEM_SEQ_BANK0_SIZE                 0x2000UL    /**> SEQ_RAM_BANK0_SIZE */
#define RDMEM_SEQ_BANK1_SIZE                 0x2000UL    /**> SEQ_RAM_BANK1_SIZE */
#define RDMEM_SEQ_BANK2_SIZE                 0x0UL       /**> SEQ_RAM_BANK2_SIZE */
#define RDMEM_SEQ_BANK3_SIZE                 0x0UL       /**> SEQ_RAM_BANK3_SIZE */
#define RDMEM_SEQ_BANK4_SIZE                 0x0UL       /**> SEQ_RAM_BANK4_SIZE */
#define RDMEM_SEQ_BANK5_SIZE                 0x0UL       /**> SEQ_RAM_BANK5_SIZE */
#define RDMEM_SEQ_BANK6_SIZE                 0x0UL       /**> SEQ_RAM_BANK6_SIZE */
#define RDMEM_SEQ_BANK7_SIZE                 0x0UL       /**> SEQ_RAM_BANK7_SIZE */
#define RDMEM_SEQ_NUM_BANK                   0x2UL       /**> SEQ_NUM_BANK */
#define RDMEM_SEQ_RAMADDRBITS                0xEUL       /**> SEQ RAM ADDRBITS */
#define RDMEM_SEQ_RAMADDRMINBITS             0xDUL       /**> SEQ RAM address bits for one bank */
#define RDMEM_SEQ_RAMECCADDR_WIDTH           0x20UL      /**> SEQ RAM ECC Address width */
#define RDMEM_SEQ_RAM_BWE_WIDTH              0x27UL      /**> SEQRAM BWE width */
#define RDMEM_SEQ_RAM_DATA_WIDTH             0x27UL      /**> SEQ_RAM_DATA_WIDTH */
#define RDMEM_SEQ_RAM_ECC_EN                 0x1UL       /**> SEQ RAM ECCEN */
#define RDMEM_SEQ_RAM_TOTAL_SIZE             0x4000UL    /**> SEQ_RAM_TOTAL_SIZE */

/* Instance macros for ACMP */
#define ACMP(n)                        (((n) == 0) ? ACMP0   \
                                        : ((n) == 1) ? ACMP1 \
                                        : 0x0UL)
#define ACMP_NUM(ref)                  (((ref) == ACMP0) ? 0   \
                                        : ((ref) == ACMP1) ? 1 \
                                        : -1)
#define ACMP_DAC_INPUT(n)              (((n) == 0) ? ACMP0_DAC_INPUT   \
                                        : ((n) == 1) ? ACMP1_DAC_INPUT \
                                        : 0x0UL)
#define ACMP_EXT_OVR_IF(n)             (((n) == 0) ? ACMP0_EXT_OVR_IF   \
                                        : ((n) == 1) ? ACMP1_EXT_OVR_IF \
                                        : 0x0UL)

